clifjones/ESP32APRS_Audio/src/main.cpp
        if (speed > 5)
        {
            speed = spd;
            course = gps_course;
        }
    }
    LastLat = nowLat;
    LastLng = nowLng;
    lastTimeStamp = nowTime;

    if (!LITTLEFS.exists(dfName))
    {
        header = true;
    }

    File f = LITTLEFS.open(dfName, "a");
#ifdef DEBUG
    log_d("====== Writing to data file =========");
    log_d("Open File %s", dfName);
#endif
    if (!f)
    {
#ifdef DEBUG
        log_d("Data file open failed");
#endif
    }
    else
    {
        if (header)
        {
            // col = "\"dd/mm/yyyy h:m\",\"Weight Origin(Kg)\",\"Weight(Kg)\",\"Water Drain(L)\",\"Water Height(mm)\",\"Temperature(C)\",\"Raw\"";
            col = "dd/mm/yyyy h:m:s";
            col += ",Latitude";
            col += ",Longitude";
            col += ",Speed(kph)";
            col += ",Course(°)";
            for (int s = 0; s < WX_SENSOR_NUM; s++)
            {
                int senIdx = config.wx_sensor_ch[s];
                if ((config.wx_sensor_enable[s] == 0) || (senIdx == 0))
                {
                    continue;
                }
                else
                {
                    senIdx -= 1;
                    col += "," + String(String(WX_SENSOR[s])) + "(" + String(config.sensor[senIdx].unit) + ")";
                }
            }
            f.println(col);
        }
        sprintf(datetime, "%d-%02d-%02d %02d:%02d:%02d", (tmstruct.tm_year) + 1900, (tmstruct.tm_mon) + 1, tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);
        sprintf(data, "%s,%0.5f,%0.5f,%0.2f,%d", datetime, lat, lon, speed, (int)course);
        for (int s = 0; s < WX_SENSOR_NUM; s++)
        {
            int senIdx = config.wx_sensor_ch[s];
            if ((config.wx_sensor_enable[s] == 0) || (senIdx == 0))
            {
                continue;
            }
            else
            {
                strcat(data, ",");
                senIdx -= 1;
                double val = 0;
                if (sen[senIdx].visable)
                {
                    if ((config.wx_sensor_avg[s] && (config.sensor[senIdx].averagerate <= config.sensor[senIdx].samplerate)) || (sen[senIdx].timeAvg == 0))
                        val = sen[senIdx].sample;
                    else
                        val = sen[senIdx].average;
                }
                strcat(data, String(val, 2).c_str());
            }
        }
        f.println(data);
        f.close();
#ifdef DEBUG
        log_d("Data file updated");
#endif
    }
}

void defaultConfig()
{
    log_d("Default configure mode!");
    config.synctime = true;
    config.timeZone = 7;
    config.tx_timeslot = 2000; // ms

    config.wifi_mode = WIFI_AP_STA_FIX;
    config.wifi_power = 44; // WIFI_POWER_11dBm
    config.wifi_ap_ch = 6;
    config.wifi_sta[0].enable = true;
    sprintf(config.wifi_sta[0].wifi_ssid, "APRSTH");
    sprintf(config.wifi_sta[0].wifi_pass, "aprsthnetwork");
    for (int i = 1; i < 5; i++)
    {
        config.wifi_sta[i].enable = false;
        config.wifi_sta[i].wifi_ssid[0] = 0;
        config.wifi_sta[i].wifi_pass[0] = 0;
    }
    sprintf(config.wifi_ap_ssid, "ESP32APRS_Audio");
    sprintf(config.wifi_ap_pass, "aprsthnetwork");

    // Blutooth
    config.bt_slave = false;
    config.bt_master = false;
    config.bt_mode = 1; // 0-None,1-TNC2RAW,2-KISS
    config.bt_power = 3;
    sprintf(config.bt_name, "ESP32APRS_Audio");
    config.bt_pin = 0;
// #if !defined(CONFIG_IDF_TARGET_ESP32)
//     // Bluetooth BLE
//     sprintf(config.bt_uuid, "00000001-ba2a-46c9-ae49-01b0961f68bb");
//     sprintf(config.bt_uuid_rx, "00000002-ba2a-46c9-ae49-01b0961f68bb");
//     sprintf(config.bt_uuid_tx, "00000003-ba2a-46c9-ae49-01b0961f68bb");
// #endif

    //--RF Module
    config.rf_en = false;
    config.rf_type = RF_SA868_VHF;
    config.freq_rx = 144.3900;
    config.freq_tx = 144.3900;
    config.offset_rx = 0;
    config.offset_tx = 0;
    config.tone_rx = 0;
    config.tone_tx = 0;
    config.band = 0;
    config.sql_level = 1;
    config.rf_power = LOW;
    config.volume = 6;
    config.mic = 8;
    config.modem_type = 1;

#ifdef ESP32C3_MINI
    // config.wifi_power = 74;
    config.rf_tx_gpio = -1;
    config.rf_rx_gpio = -1;
    config.rf_sql_gpio = -1;
    config.rf_pd_gpio = -1;
    config.rf_pwr_gpio = -1;
    config.rf_ptt_gpio = 3;
    config.rf_sql_active = 0;
    config.rf_pd_active = 1;
    config.rf_pwr_active = 1;
    config.rf_ptt_active = 0;
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
    config.rf_tx_gpio = 17;
    config.rf_rx_gpio = 18;
    config.rf_sql_gpio = -1;
    config.rf_pd_gpio = 4;
    config.rf_pwr_gpio = -1;
    config.rf_ptt_gpio = 5;
    config.rf_sql_active = 0;
    config.rf_pd_active = 1;
    config.rf_pwr_active = 1;
    config.rf_ptt_active = 1;
#else
    config.rf_tx_gpio = 13;
    config.rf_rx_gpio = 14;
    config.rf_sql_gpio = -1;
    config.rf_pd_gpio = 27;
    config.rf_pwr_gpio = -1;
    config.rf_ptt_gpio = 32;
    config.rf_sql_active = 0;
    config.rf_pd_active = 1;
    config.rf_pwr_active = 1;
    config.rf_ptt_active = 1;
#endif
    config.adc_atten = 0;
    config.adc_dc_offset = 600;
    config.rf_baudrate = 9600;

    config.audio_hpf = false;
    config.audio_lpf = false;
    config.preamble = 3;
    sprintf(config.ntp_host, "aprs.nakhonthai.net");

    // IGATE
    config.igate_bcn = false;
    config.igate_en = false;
    config.rf2inet = true;
    config.inet2rf = false;
    config.igate_loc2rf = false;
    config.igate_loc2inet = true;
    config.rf2inetFilter = 0xFFF; // All
    config.inet2rfFilter = config.digiFilter = FILTER_OBJECT | FILTER_ITEM | FILTER_MESSAGE | FILTER_MICE | FILTER_POSITION | FILTER_WX;
    //--APRS-IS
    config.aprs_ssid = 1;
    config.aprs_port = 14580;
    sprintf(config.aprs_mycall, "NOCALL");
    sprintf(config.aprs_host, "aprs.nakhonthai.net");
    memset(config.aprs_passcode, 0, sizeof(config.aprs_passcode));
    sprintf(config.aprs_moniCall, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    sprintf(config.aprs_filter, "m/10");
    //--Position
    config.igate_gps = false;
    config.igate_lat = 13.7555;
    config.igate_lon = 100.4930;
    config.igate_alt = 0;
    config.igate_interval = 600;
    sprintf(config.igate_symbol, "A&");
    memset(config.igate_object, 0, sizeof(config.igate_object));
    memset(config.igate_phg, 0, sizeof(config.igate_phg));
    config.igate_path = 8;
    sprintf(config.igate_comment, "");
    sprintf(config.igate_status, "https://github.com/nakhonthai/ESP32APRS_Audio");
    config.igate_sts_interval = 1800;

    // DIGI REPEATER
    config.digi_en = false;
    config.digi_auto = false;
    config.digi_loc2rf = true;
    config.digi_loc2inet = false;
    config.digi_ssid = 3;
    config.digi_timestamp = false;
    sprintf(config.digi_mycall, "NOCALL");
    config.digi_path = 8;
    //--Position
    config.digi_gps = false;
    config.digi_lat = 13.7555;
    config.digi_lon = 100.4930;
    config.digi_alt = 0;
    config.digi_interval = 600;
    config.igate_timestamp = false;
    config.digi_delay = 0;
    config.digiFilter = FILTER_OBJECT | FILTER_ITEM | FILTER_MESSAGE | FILTER_MICE | FILTER_POSITION | FILTER_WX;

