clifjones/ESP32APRS_Audio/src/main.cpp
    config.sensor[7].enable = false;
    config.sensor[7].port = 0;
    config.sensor[7].address = 2;
    config.sensor[7].samplerate = 10;
    config.sensor[7].averagerate = 600;
    config.sensor[7].eqns[0] = 0; // a
    config.sensor[7].eqns[1] = 1; // b
    config.sensor[7].eqns[2] = 0; // c
    config.sensor[7].type = SENSOR_PRESSURE;
    sprintf(config.sensor[7].parm, "Pressure");
    sprintf(config.sensor[7].unit, "hPa(mBar)");

    config.sensor[8].enable = false;
    config.sensor[8].port = 0;
    config.sensor[8].address = 2;
    config.sensor[8].samplerate = 10;
    config.sensor[8].averagerate = 600;
    config.sensor[8].eqns[0] = 0;   // a
    config.sensor[8].eqns[1] = 0.2; // b
    config.sensor[8].eqns[2] = 0;   // c
    config.sensor[8].type = SENSOR_RAIN;
    sprintf(config.sensor[8].parm, "Rain");
    sprintf(config.sensor[8].unit, "mm.");

    config.sensor[9].enable = false;
    config.sensor[9].port = 0;
    config.sensor[9].address = 2;
    config.sensor[9].samplerate = 10;
    config.sensor[9].averagerate = 600;
    config.sensor[9].eqns[0] = 0; // a
    config.sensor[9].eqns[1] = 1; // b
    config.sensor[9].eqns[2] = 0; // c
    config.sensor[9].type = SENSOR_WIND_SPD;
    sprintf(config.sensor[9].parm, "Wind Speed");
    sprintf(config.sensor[9].unit, "kPh");

// #ifdef CORE_DEBUG_LEVEL
//     config.uart0_enable = false;
//     config.uart0_baudrate = 115200;
//     config.uart0_rx_gpio = 20;
//     config.uart0_tx_gpio = 21;
//     config.uart0_rts_gpio = -1;
#if defined(CONFIG_IDF_TARGET_ESP32S3)
    config.uart0_enable = false;
    config.uart0_baudrate = 115200;
    config.uart0_rx_gpio = 44;
    config.uart0_tx_gpio = 43;
    config.uart0_rts_gpio = -1;
#else
    config.uart0_enable = false;
    config.uart0_baudrate = 9600;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.uart0_rts_gpio = -1;
#endif

#ifdef ESP32C3_MINI
    config.uart1_enable = false;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 21;
    config.uart1_tx_gpio = 20;
    config.uart1_rts_gpio = -1;
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
    config.uart1_enable = false;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 18;
    config.uart1_tx_gpio = 17;
    config.uart1_rts_gpio = -1;
#else
    config.uart1_enable = false;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 18;
    config.uart1_tx_gpio = 19;
    config.uart1_rts_gpio = -1;
#endif

    config.uart2_enable = false;
    config.uart2_baudrate = 9600;
    config.uart2_rx_gpio = 16;
    config.uart2_tx_gpio = 17;
    config.uart2_rts_gpio = -1;

    config.modbus_enable = false;
    config.modbus_de_gpio = -1;
    config.modbus_address = 0;
    config.modbus_channel = 0;

    config.onewire_enable = false;
    config.onewire_gpio = -1;

    config.pwr_en = false;
    config.pwr_mode = MODE_A;        // A=Continue,B=Wait for receive,C=Send and sleep
    config.pwr_sleep_interval = 600; // sec
    config.pwr_stanby_delay = 300;   // sec
    config.pwr_sleep_activate = ACTIVATE_TRACKER | ACTIVATE_WIFI;
    config.pwr_gpio = -1;
    config.pwr_active = 1;

    for (int i = 0; i < 5; i++)
    {
        config.trk_tlm_avg[i] = false;
        config.trk_tlm_sensor[i] = 0;
        config.trk_tlm_precision[i] = 0;
        config.trk_tlm_offset[i] = 0;
        memset(config.trk_tlm_UNIT[i], 0, 8);
        memset(config.trk_tlm_PARM[i], 0, 10);
        config.trk_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.trk_tlm_EQNS[i][1] = 1; // b
        config.trk_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < 5; i++)
    {
        config.digi_tlm_avg[i] = false;
        config.digi_tlm_sensor[i] = 0;
        config.digi_tlm_precision[i] = 0;
        config.digi_tlm_offset[i] = 0;
        memset(config.digi_tlm_UNIT[i], 0, 8);
        memset(config.digi_tlm_PARM[i], 0, 10);
        config.digi_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.digi_tlm_EQNS[i][1] = 1; // b
        config.digi_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < 5; i++)
    {
        config.igate_tlm_avg[i] = false;
        config.igate_tlm_sensor[i] = 0;
        config.igate_tlm_precision[i] = 0;
        config.igate_tlm_offset[i] = 0;
        memset(config.igate_tlm_UNIT[i], 0, 8);
        memset(config.igate_tlm_PARM[i], 0, 10);
        config.igate_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.igate_tlm_EQNS[i][1] = 1; // b
        config.igate_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < WX_SENSOR_NUM; i++)
    {
        config.wx_sensor_enable[i] = false;
        config.wx_sensor_avg[i] = true;
        config.wx_sensor_ch[i] = 0;
    }

#ifdef OLED
#ifdef ESP32C3_MINI
    config.i2c_enable = true;
    config.i2c_sda_pin = 5;
    config.i2c_sck_pin = 6;
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
    config.i2c_enable = true;
    config.i2c_sda_pin = 42;
    config.i2c_sck_pin = 41;
#else
    config.i2c_enable = true;
    config.i2c_sda_pin = 21;
    config.i2c_sck_pin = 22;
#endif
#else
    config.i2c_enable = false;
    config.i2c_sda_pin = -1;
    config.i2c_sck_pin = -1;
#endif
    config.i2c_freq = 400000;
    config.i2c1_enable = false;
    config.i2c1_sda_pin = -1;
    config.i2c1_sck_pin = -1;
    config.i2c1_freq = 100000;

    config.counter0_enable = false;
    config.counter0_active = 0;
    config.counter0_gpio = -1;

    config.counter1_enable = false;
    config.counter1_active = 0;
    config.counter1_gpio = -1;

    config.ext_tnc_enable = false;
    config.ext_tnc_channel = 0;
    config.ext_tnc_mode = 2;

    sprintf(config.path[0], "TRACE2-2");
    sprintf(config.path[1], "WIDE1-1");
    sprintf(config.path[2], "WIDE1-1,WIDE2-1");
    sprintf(config.path[3], "RFONLY");

    config.msg_enable = true;
    config.msg_encrypt = false;
    config.msg_rf = true;
    config.msg_inet = true;
    config.msg_retry = 3;
    config.msg_interval = 30; // second
    config.msg_path = 9;
    sprintf(config.msg_key, "8EC8233E91D59B0164C24E771BA66307");
    sprintf(config.msg_mycall, "NOCALL");

