clifjones/ESP32APRS_Audio/src/main.cpp
#ifdef OLED
    if (config.oled_enable)
    {
        i2c_busy = true;
        Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);
// by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
// display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false); // initialize with the I2C addr 0x3C (for the 128x64)
#ifdef SH1106
        display.begin(SH1106_SWITCHCAPVCC, SCREEN_ADDRESS, OLED_RESET > -1);
#else
        display.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS, OLED_RESET > -1, false);
#endif
        // Initialising the UI will init the display too.
        display.clearDisplay();
        display.setTextSize(1);
        display.setTextColor(WHITE);

        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);
        display.setCursor(0, 15);
        display.print("APRS");
        display.setCursor(60, 32);
        display.print("AUDIO");
        display.drawYBitmap(0, 16, LOGO, 48, 48, WHITE);
        display.drawRoundRect(52, 16, 75, 22, 3, WHITE);

        display.setFont();
        display.setTextColor(WHITE);

        display.setCursor(60, 40);
        display.printf("FW Ver %s%c", VERSION, VERSION_BUILD);
        display.setCursor(65, 5);
        display.print("Copy@2022");
        display.display();
        LED_Status(255, 0, 0);
        delay(1000);
        // digitalWrite(LED_TX, HIGH);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("3 Sec");
        display.display();
        LED_Status(0, 255, 0);
        delay(1000);
        // digitalWrite(LED_RX, HIGH);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("2 Sec");
        display.display();
        LED_Status(0, 0, 255);
        delay(1000);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("1 Sec");
        display.display();
        LED_Status(0, 0, 0);
        i2c_busy = false;
    }
    else
    {
        LED_Status(200, 0, 0);
        delay(1000);
        LED_Status(0, 200, 0);
        delay(1000);
        LED_Status(0, 0, 200);
        delay(1000);
    }
#else
    if (config.i2c_enable)
    {
        Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);
    }
    LED_Status(200, 0, 0);
    delay(1000);
    LED_Status(0, 200, 0);
    delay(1000);
    LED_Status(0, 0, 200);
    delay(1000);
#endif

    if (digitalRead(BOOT_PIN) == LOW)
    {
        defaultConfig();
        Serial.println("Manual Default configure!");
#ifdef OLED
        display.clearDisplay();
        display.setCursor(10, 22);
        display.print("Factory Reset!");
        display.display();
#endif
        while (digitalRead(BOOT_PIN) == LOW)
        {
            delay(500);
            LED_Status(0, 0, 0);
            delay(500);
            LED_Status(255, 255, 255);
        }
    }
    LED_Status(0, 0, 0);

    // if (config.counter0_enable)
    // {
    //     pcnt_init_channel(PCNT_UNIT_0, config.counter0_gpio, config.counter0_active); // Initialize Unit 0 to pin 4
    // }
    // if (config.counter1_enable)
    // {
    //     pcnt_init_channel(PCNT_UNIT_1, config.counter1_gpio, config.counter1_active); // Initialize Unit 0 to pin 4
    // }
#if ARDUINO_USB_MODE
    Serial.begin(115200);
#endif

    if (config.uart0_enable)
    {
        pinMode(config.uart0_rx_gpio, INPUT_PULLUP); // Set RX pin to INPUT_PULLUP
        pinMode(config.uart0_tx_gpio, OUTPUT);       // Set TX pin to OUTPUT
        Serial0.begin(config.uart0_baudrate, SERIAL_8N1, config.uart0_rx_gpio, config.uart0_tx_gpio);
    }
    if (config.uart1_enable)
    {
        pinMode(config.uart1_rx_gpio, INPUT_PULLUP); // Set RX pin to INPUT_PULLUP
        pinMode(config.uart1_tx_gpio, OUTPUT);       // Set TX pin to OUTPUT
        Serial1.begin(config.uart1_baudrate, SERIAL_8N1, config.uart1_rx_gpio, config.uart1_tx_gpio);
    }
#if SOC_UART_NUM > 2
    pinMode(config.uart2_rx_gpio, INPUT_PULLUP); // Set RX pin to INPUT_PULLUP
    pinMode(config.uart2_tx_gpio, OUTPUT);       // Set TX pin to OUTPUT
    Serial2.begin(config.uart2_baudrate, SERIAL_8N1, config.uart2_rx_gpio, config.uart2_tx_gpio);
#endif
    log_d("MODBUS config");
    if (config.modbus_enable)
    {
        if (config.modbus_channel == 1)
        {
            modbus.begin(config.modbus_address, Serial);
        }
        else if (config.modbus_channel == 2)
        {
            modbus.begin(config.modbus_address, Serial1);
        }
#ifdef __XTENSA__
        else if (config.modbus_channel == 3)
        {
            modbus.begin(config.modbus_address, Serial2);
        }
#endif
        if (config.modbus_channel > 0 && config.modbus_channel < 4)
        {
            // Modbus slave ID 1
            if (config.modbus_de_gpio > -1)
            {
                pinMode(config.modbus_de_gpio, OUTPUT);
                // Callbacks allow us to configure the RS485 transceiver correctly
                modbus.preTransmission(preTransmission);
                modbus.postTransmission(postTransmission);
            }
        }
    }

    log_d("RF Module config");
    delay(10);

    if (config.rf_en)
        RF_MODULE(true);
    log_d("Free heap: %d", ESP.getHeapSize());

#ifdef OLED
    if (config.oled_enable == true)
    {
        display.clearDisplay();
        display.setTextSize(1);
        display.display();
    }
#endif

    showDisp = true;
    if (curTab > 7)
        curTab = 6;
    oledSleepTimeout = millis() + (config.oled_timeout * 1000);

    // enableLoopWDT();
    // enableCore0WDT();
    // enableCore1WDT();
    // disableCore1WDT();
    //      esp_task_wdt_config_t twdt_config = {
    //         .timeout_ms = 3000,                             // 3 seconds
    //         .idle_core_mask = (1 << portNUM_PROCESSORS) - 1, // Bitmask of all cores
    //         .trigger_panic = false,
    //     };
    //     //#if !defined(CONFIG_IDF_TARGET_ESP32C6)
    //     esp_task_wdt_init(&twdt_config); // enable panic so ESP32 restarts
    // // #else
    // //     esp_task_wdt_init(&twdt_config); // enable panic so ESP32 restarts
    // // #endif
    //     esp_task_wdt_add(NULL);

    oledSleepTimeout = millis() + (config.oled_timeout * 1000);
    AFSKInitAct = false;
    log_d("GNSS config");
    if (config.gnss_enable)
    {
        if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
        {
            if (strstr("AT", config.gnss_at_command) != NULL)
            {
                if (config.gnss_channel == 1)
                {
                    Serial0.println(config.gnss_at_command);
                }
                else if (config.gnss_channel == 2)
                {
                    Serial1.println(config.gnss_at_command);
                }
#if SOC_UART_NUM > 2
                else if (config.gnss_channel == 3)
                {
                    Serial2.println(config.gnss_at_command);
                }
#endif
            }
        }
    }
    log_d("Start Task");
#ifdef __XTENSA__
    // if (config.wifi_mode != 0)
    //{
    xTaskCreatePinnedToCore(
        taskNetwork,        /* Function to implement the task */
        "taskNetwork",      /* Name of the task */
        12000,              /* Stack size in words */
        NULL,               /* Task input parameter */
        0,                  /* Priority of the task */
        &taskNetworkHandle, /* Task handle. */
        1);                 /* Core where the task should run */
    //}
    xTaskCreatePinnedToCore(
        taskAPRSPoll,        /* Function to implement the task */
        "taskAPRSPoll",      /* Name of the task */
        2048,                /* Stack size in words */
        NULL,                /* Task input parameter */
        1,                   /* Priority of the task */
        &taskAPRSPollHandle, /* Task handle. */
        1);                  /* Core where the task should run */
    xTaskCreatePinnedToCore(
        taskAPRS,        /* Function to implement the task */
        "taskAPRS",      /* Name of the task */
        4096,            /* Stack size in words */
        NULL,            /* Task input parameter */
        2,               /* Priority of the task */
        &taskAPRSHandle, /* Task handle. */
        1);              /* Core where the task should run */
#else
    // if (config.wifi_mode != 0)
    //{
    xTaskCreatePinnedToCore(
        taskNetwork,        /* Function to implement the task */
        "taskNetwork",      /* Name of the task */
        12000,              /* Stack size in words */
        NULL,               /* Task input parameter */
        1,                  /* Priority of the task */
        &taskNetworkHandle, /* Task handle. */
        0);                 /* Core where the task should run */
    //}

    xTaskCreatePinnedToCore(
        taskAPRSPoll,        /* Function to implement the task */
        "taskAPRSPoll",      /* Name of the task */
        2048,                /* Stack size in words */
        NULL,                /* Task input parameter */
        0,                   /* Priority of the task */
        &taskAPRSPollHandle, /* Task handle. */
        0);                  /* Core where the task should run */

    xTaskCreatePinnedToCore(
        taskAPRS,        /* Function to implement the task */
        "taskAPRS",      /* Name of the task */
        6000,            /* Stack size in words */
        NULL,            /* Task input parameter */
        2,               /* Priority of the task */
        &taskAPRSHandle, /* Task handle. */
        0);              /* Core where the task should run */
#endif

    if (config.gnss_enable)
    {
        xTaskCreatePinnedToCore(
            taskGPS,        /* Function to implement the task */
            "taskGPS",      /* Name of the task */
            3072,           /* Stack size in words */
            NULL,           /* Task input parameter */
            4,              /* Priority of the task */
            &taskGPSHandle, /* Task handle. */
            0);             /* Core where the task should run */
    }

    if (config.ext_tnc_enable || config.at_cmd_uart > 0 || config.wx_en)
    {
        xTaskCreatePinnedToCore(
            taskSerial,        /* Function to implement the task */
            "taskSerial",      /* Name of the task */
            2048,              /* Stack size in words */
            NULL,              /* Task input parameter */
            5,                 /* Priority of the task */
            &taskSerialHandle, /* Task handle. */
            0);                /* Core where the task should run */
    }

    bool SensorEn = false;
    for (int i = 0; i < SENSOR_NUMBER; i++)
    {
        if (config.sensor[i].enable)
        {
            SensorEn = true;
            break;
        }
    }

    if (SensorEn == true)
    {
        xTaskCreatePinnedToCore(
            taskSensor,        /* Function to implement the task */
            "taskSensor",      /* Name of the task */
            4096,              /* Stack size in words */
            NULL,              /* Task input parameter */
            6,                 /* Priority of the task */
            &taskSensorHandle, /* Task handle. */
            0);                /* Core where the task should run */
    }

    upTimeStamp = millis() / 1000;
    autoResetTimeout = millis() + ((long)config.reset_timeout * 60000);
}

String getTimeStamp()
{
    char strtmp[50];
    time_t now;
    time(&now);
    struct tm *info = gmtime(&now);
    sprintf(strtmp, "%02d%02d%02dz", info->tm_mday, info->tm_hour, info->tm_min);
    return String(strtmp);
}

int pkgCount = 0;

float conv_coords(float in_coords)
{
    // Initialize the location.
    float f = in_coords;
    // Get the first two digits by turning f into an integer, then doing an integer divide by 100;
    // firsttowdigits should be 77 at this point.
    int firsttwodigits = ((int)f) / 100; // This assumes that f < 10000.
    float nexttwodigits = f - (float)(firsttwodigits * 100);
    float theFinalAnswer = (float)(firsttwodigits + nexttwodigits / 60.0);
    return theFinalAnswer;
}

void DD_DDDDDtoDDMMSS(float DD_DDDDD, int *DD, int *MM, int *SS)
{
    DD_DDDDD = abs(DD_DDDDD);
    *DD = (int)DD_DDDDD;
    *MM = (int)((DD_DDDDD - *DD) * 60);
    *SS = ((DD_DDDDD - *DD) * 60 - *MM) * 100;
}

String compress_position(double nowLat, double nowLng, int alt_feed, double course, uint16_t spdKnot, char table, char symbol, bool gps)
{
    String str_comp = "";
    // String lat, lon;
    // lat = deg2lat(nowLat);
    // lon = deg2lon(nowLng);
    char lat[15], lon[15];
    memset(lat, 0, sizeof(lat));
    memset(lon, 0, sizeof(lon));
    deg2lat(lat, nowLat);
    deg2lon(lon, nowLng);
    // ESP_LOGE("GPS", "Aprs Compress");
    //  Translate from semicircles to Base91 format
    char aprs_position[15];
    long latitude = semicircles(lat, (nowLat < 0));
    long longitude = semicircles(lon, (nowLng < 0));
    long ltemp = 1073741824L - latitude; // 90 degrees - latitude
    // ESP_LOGE("GPS", "lat=%u lon=%u", latitude, longitude);
    memset(aprs_position, 0, sizeof(aprs_position));

