clifjones/ESP32APRS_Audio/src/main.cpp
    if (config.aprs_ssid == 0)
    {
        if (config.igate_path < 5)
        {
            if (config.igate_path > 0)
                sprintf(str, "%s>APE32A-%d::%s:%s ", config.aprs_mycall, config.igate_path, call, raw);
            else
                sprintf(str, "%s>APE32A::%s:%s ", config.aprs_mycall, call, raw);
        }
        else
        {
            sprintf(str, "%s>APE32A,%s::%s:%s ", config.aprs_mycall, getPath(config.igate_path).c_str(), call, raw);
        }
    }
    else
    {
        if (config.igate_path < 5)
        {
            if (config.igate_path > 0)
                sprintf(str, "%s-%d>APE32A-%d::%s:%s ", config.aprs_mycall, config.aprs_ssid, config.igate_path, call, raw);
            else
                sprintf(str, "%s-%d>APE32A::%s:%s ", config.aprs_mycall, config.aprs_ssid, call, raw);
        }
        else
        {
            sprintf(str, "%s-%d>APE32A,%s::%s:%s ", config.aprs_mycall, config.aprs_ssid, getPath(config.igate_path).c_str(), call, raw);
        }
    }

    uint8_t SendMode = 0;
    if (config.igate_loc2rf)
        SendMode |= RF_CHANNEL;
    if (config.igate_loc2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(str, strlen(str), 0, SendMode);
    // if (config.igate_loc2rf)
    // { // TLM SEND TO RF
    //     pkgTxPush(str, strlen(str), 0);
    // }
    // if (config.igate_loc2inet)
    // { // TLM SEND TO APRS-IS
    //     if (aprsClient.connected())
    //     {
    //         status.txCount++;
    //         aprsClient.printf("%s\r\n", str); // Send packet to Inet
    //         delay(2000);
    //     }
    // }
}

void sendTelemetry_digi(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);

    if (config.digi_ssid == 0)
        sprintf(call, "%s", config.digi_mycall);
    else
        sprintf(call, "%s-%d", config.digi_mycall, config.digi_ssid);
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (config.digi_ssid == 0)
    {
        if (config.digi_path < 5)
        {
            if (config.digi_path > 0)
                sprintf(str, "%s>APE32A-%d::%s:%s ", config.digi_mycall, config.digi_path, call, raw);
            else
                sprintf(str, "%s>APE32A::%s:%s ", config.digi_mycall, call, raw);
        }
        else
        {
            sprintf(str, "%s>APE32A,%s::%s:%s ", config.digi_mycall, getPath(config.digi_path).c_str(), call, raw);
        }
    }
    else
    {
        if (config.digi_path < 5)
        {
            if (config.digi_path > 0)
                sprintf(str, "%s-%d>APE32A-%d::%s:%s ", config.digi_mycall, config.digi_ssid, config.digi_path, call, raw);
            else
                sprintf(str, "%s-%d>APE32A::%s:%s ", config.digi_mycall, config.digi_ssid, call, raw);
        }
        else
        {
            sprintf(str, "%s-%d>APE32A,%s::%s:%s ", config.digi_mycall, config.digi_ssid, getPath(config.digi_path).c_str(), call, raw);
        }
    }

    uint8_t SendMode = 0;
    if (config.digi_loc2rf)
        SendMode |= RF_CHANNEL;
    if (config.digi_loc2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(str, strlen(str), 0, SendMode);
    // if (config.digi_loc2rf)
    // { // TLM SEND TO RF
    //     pkgTxPush(str, strlen(str), 0);
    // }
    // if (config.digi_loc2inet)
    // { // TLM SEND TO APRS-IS
    //     if (aprsClient.connected())
    //     {
    //         status.txCount++;
    //         aprsClient.printf("%s\r\n", str); // Send packet to Inet
    //         delay(2000);
    //     }
    // }
}

RTC_DATA_ATTR statusType statOld;
uint8_t getState(int ch)
{
    int val = 0;
    switch (ch)
    {
    case 0: // none
        val = 0;
        break;
    case 1: // allCount
        val = status.allCount - statOld.allCount;
        statOld.allCount = status.allCount;
        break;
    case 2: // rf2inet
        val = status.rf2inet - statOld.rf2inet;
        statOld.rf2inet = status.rf2inet;
        break;
    case 3: // inet2rf
        val = status.inet2rf - statOld.inet2rf;
        statOld.inet2rf = status.inet2rf;
        break;
    case 4: // digi
        val = status.digiCount - statOld.digiCount;
        statOld.digiCount = status.digiCount;
        break;
    case 5: // Drop
        val = status.dropCount - statOld.dropCount;
        statOld.dropCount = status.dropCount;
        break;
    }
    if (val < 0)
        val = 0;
    return val;
}

bool getBits(int ch)
{
    bool val = false;
    switch (ch)
    {
    case 0: // none
        val = 0;
        break;
    case 1: // IGATE Enable
        val = config.igate_en;
        break;
    case 2: // DIGI Enable
        val = config.digi_en;
        break;
    case 3: // WX Enable
        val = config.wx_en;
        break;
    case 4: // Sat Enable
        val = 0;
        break;
    case 5: // APRS-IS Status
        if (aprsClient.connected())
            val = 1;
        break;
    case 6: // VPN Status
        val = wireguard_active();
        break;
    case 7: // 4G LTE
        val = 0;
        break;
    case 8: // FX.25
        val = (config.fx25_mode > 0) ? 1 : 0;
        break;
    }
    return val;
}

void getTelemetry_0()
{
    systemTLM.A1 = getState(config.tml0_data_channel[0]);
    systemTLM.A2 = getState(config.tml0_data_channel[1]);
    systemTLM.A3 = getState(config.tml0_data_channel[2]);
    systemTLM.A4 = getState(config.tml0_data_channel[3]);
    systemTLM.A5 = getState(config.tml0_data_channel[4]);
    systemTLM.BITS = 0;
    if (getBits(config.tml0_data_channel[5]))
        systemTLM.BITS |= 0x01;
    if (getBits(config.tml0_data_channel[6]))
        systemTLM.BITS |= 0x02;
    if (getBits(config.tml0_data_channel[7]))
        systemTLM.BITS |= 0x04;
    if (getBits(config.tml0_data_channel[8]))
        systemTLM.BITS |= 0x08;
    if (getBits(config.tml0_data_channel[9]))
        systemTLM.BITS |= 0x10;
    if (getBits(config.tml0_data_channel[10]))
        systemTLM.BITS |= 0x20;
    if (getBits(config.tml0_data_channel[11]))
        systemTLM.BITS |= 0x40;
    if (getBits(config.tml0_data_channel[12]))
        systemTLM.BITS |= 0x80;
}

String getPath(int idx)
{
    String ret = "";
    switch (idx)
    {
    case 0: // OFF
        ret = "";
        break;
    case 1: // DST-TRACE1
    case 2: // DST-TRACE2
    case 3: // DST-TRACE3
    case 4: // DST-TRACE4
        ret = "DST" + String(idx);
        break;
    case 5: // TRACE1-1
        ret = "TRACE1-1";
        break;
    case 6:
        ret = "TRACE2-2";
        break;
    case 7:
        ret = "TRACE3-3";
        break;
    case 8:
        ret = "WIDE1-1";
        break;
    case 9:
        ret = "RFONLY";
        break;
    case 10:
        ret = "RELAY";
        break;
    case 11:
        ret = "GATE";
        break;
    case 12:
        ret = "ECHO";
        break;
    case 13: // UserDefine1
        ret = String(config.path[0]);
        break;
    case 14: // UserDefine2
        ret = String(config.path[1]);
        break;
    case 15: // UserDefine3
        ret = String(config.path[2]);
        break;
    case 16: // UserDefine4
        ret = String(config.path[3]);
        break;
    default:
        ret = "WIDE1-1";
        break;
    }
    return ret;
}

void GPS_INIT()
{
    // SerialGPS.begin(config.gnss_baudrate, SERIAL_8N1, config.gnss_rx_gpio, config.gnss_tx_gpio);
    //  SerialGPS.begin(config.gnss_baudrate, EspSoftwareSerial::SWSERIAL_8N1, config.gnss_rx_gpio, config.gnss_tx_gpio);
    // SerialGPS.flush();
    //  while (SerialGPS.available() > 0)
    //      SerialGPS.read();
}

WiFiClient gnssClient;
// WiFiClient tncClient;

extern AsyncWebSocket ws_gnss;
unsigned long gnssTimeInterval = 0;

// void taskGPSActive()
// {
//     int c;
//     // log_d("GNSS Init");
//     nmea_idx = 0;

//     // if (config.gnss_enable)
//     // {
//     //     if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
//     //     {
//     //         if (strstr("AT", config.gnss_at_command) >= 0)
//     //         {
//     //             if (config.gnss_channel == 1)
//     //             {
//     //                 Serial.println(config.gnss_at_command);
//     //             }
//     //             else if (config.gnss_channel == 2)
//     //             {
//     //                 Serial1.println(config.gnss_at_command);
//     //             }
//     //             else if (config.gnss_channel == 3)
//     //             {
//     //                 Serial2.println(config.gnss_at_command);
//     //             }
//     //         }
//     //     }
//     // }
//     // for (;;)
//     {
//         if (config.gnss_enable)
//         {
//             if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
//             {
//                 do
//                 {
//                     c = -1;
//                     if (config.gnss_channel == 1)
//                     {
//                         c = Serial.read();
//                     }
//                     else if (config.gnss_channel == 2)
//                     {
//                         c = Serial1.read();
//                     }
// #ifdef __XTENSA__
//                     else if (config.gnss_channel == 3)
//                     {
//                         c = Serial2.read();
//                     }
// #endif
//                     if (c > -1)
//                     {
//                         gps.encode((char)c);
//                         if (webServiceBegin == false)
//                         {
//                             if (nmea_idx > 195)
//                             {
//                                 nmea_idx = 0;
//                                 memset(nmea, 0, sizeof(nmea));
//                                 // SerialGNSS->flush();
//                             }
//                             else
//                             {
//                                 nmea[nmea_idx++] = (char)c;
//                                 if ((char)c == '\r' || (char)c == '\n')
//                                 {
//                                     nmea[nmea_idx] = 0;
//                                     if (nmea_idx > 5)
//                                     {
//                                         if (ws_gnss.enabled() && !ws_gnss.getClients().isEmpty())
//                                         // if (webServiceBegin == false)
//                                         {
//                                             handle_ws_gnss(nmea, nmea_idx);
//                                         }
//                                         // log_d("%s",nmea);
//                                     }
//                                     nmea_idx = 0;
//                                     break;
//                                 }
//                             }
//                         }
//                         //}
//                     }
//                     else
//                     {
//                         break;
//                     }
//                 } while (1);
//             }
//             else if (config.gnss_channel == 4)
//             { // TCP
//                 if (WiFi.isConnected())
//                 {
//                     if (!gnssClient.connected())
//                     {
//                         gnssClient.connect(config.gnss_tcp_host, config.gnss_tcp_port);
//                         log_d("GNSS TCP ReConnect to %s:%d", config.gnss_tcp_host, config.gnss_tcp_port);
//                         delay(3000);
//                     }
//                     else
//                     {
//                         while (gnssClient.available())
//                         {
//                             c = (char)gnssClient.read();
//                             // Serial.print(c);
//                             gps.encode(c);
//                             if (webServiceBegin == false)
//                             {
//                                 if (nmea_idx > 195)
//                                 {
//                                     nmea_idx = 0;
//                                     memset(nmea, 0, sizeof(nmea));
//                                 }
//                                 else
//                                 {
//                                     nmea[nmea_idx++] = c;
//                                     if (c == '\r' || c == '\n')
//                                     {
//                                         nmea[nmea_idx] = 0;
//                                         if (nmea_idx > 5)
//                                         {
//                                             if (ws_gnss.enabled() && !ws_gnss.getClients().isEmpty())
//                                             {
//                                                 handle_ws_gnss(nmea, nmea_idx);
//                                             }
//                                             // log_d("%s",nmea);
//                                         }
//                                         nmea_idx = 0;
//                                     }
//                                 }
//                             }
//                         }
//                     }
//                 }
//             }

//             if (firstGpsTime && gps.time.isValid())
//             {
//                 if (gps.time.isUpdated())
//                 {
//                     time_t timeGps = getGpsTime(); // Local gps time
//                     if (timeGps > 1700000000 && timeGps < 2347462800)
//                     {
//                         setTime(timeGps);
//                         time_t rtc = timeGps;
//                         timeval tv = {rtc, 0};
//                         timezone tz = {TZ_SEC + DST_MN, 0};
//                         settimeofday(&tv, &tz);
// #ifdef DEBUG
//                         log_d("\nSET GPS Timestamp = %u Year=%d\n", timeGps, year());
// #endif
//                         // firstGpsTime = false;
//                         firstGpsTime = false;
//                         if (startTime == 0)
//                             startTime = now();
//                     }
//                     else
//                     {
//                         startTime = 0;
//                     }
//                 }
//             }
//         }
//     }
// }

// taskGPS extracted to src/task_gps.cpp

