clifjones/ESP32APRS_Audio/src/main.cpp
// taskSerial extracted to src/task_serial.cpp

unsigned long iGatetickInterval;
bool initInterval = true;

// taskAPRS extracted to src/task_aprs.cpp

// taskAPRSPoll extracted to src/task_aprs_poll.cpp

int mqttRetry = 0;
long wifiTTL = 0;

// WiFi connect timeout per AP. Increase when connecting takes longer.
const uint32_t connectTimeoutMs = 60000;
uint8_t APStationNum = 0;
unsigned long waitISRetry = 0;
unsigned long lastHeardTimeout = 0;

#ifdef PPPOS
pppType pppStatus;
long int pppTimeout = 0;
#endif

IPAddress ap_ip(192, 168, 4, 1);
IPAddress ap_mask(255, 255, 255, 0);
IPAddress ap_leaseStart(192, 168, 4, 2);
IPAddress ap_dns(8, 8, 4, 4);

uint8_t wifiStatus = WL_DISCONNECTED;
bool vpnConnected = false;
bool wifiDisconnecting = false;
uint16_t wifiDisCount = 0;
unsigned long vpnTimeout = 0;
unsigned long mitiWifiTimeout = 0;

void wifiConnection()
{
    WiFi.disconnect(true, true, 500);
    WiFi.persistent(false);
    WiFi.mode(WIFI_OFF); // Switch WiFi off

    wifiTTL = 0;
    delay(1000);
    if (config.wifi_mode == WIFI_STA_FIX)
    { /**< WiFi station mode */
        WiFi.mode(WIFI_MODE_STA);
        // WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_FIX)
    { /**< WiFi soft-AP mode */
        WiFi.mode(WIFI_MODE_AP);
        // WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_STA_FIX)
    { /**< WiFi station + soft-AP mode */
        WiFi.mode(WIFI_MODE_APSTA);
        // WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else
    {
        WiFi.mode(WIFI_MODE_NULL);
    }
    wifiMulti.APlistClean(); // Clean AP list
    for (int i = 0; i < 5; i++)
    {
        if (config.wifi_sta[i].enable)
        {
            wifiMulti.addAP(config.wifi_sta[i].wifi_ssid, config.wifi_sta[i].wifi_pass);
        }
    }
    esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
    WiFi.setHostname(config.host_name);
    if (wifiMulti.run(10000) == WL_CONNECTED)
    {
        wifiDisCount = 0;
        pingTimeout = millis() + 60000;
        NTP_Timeout = millis() + 2000;
        if(WiFi.RSSI() < -90){
            //mitiWifiTimeout = millis() + 5000;
            // Set the protocol to 802.11b and 802.11g
            esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B);
        }else if(WiFi.RSSI() < -70){
            esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G);
        }
    }
}

void onEvent(arduino_event_id_t event, arduino_event_info_t info)
{
    switch (event)
    {
#ifdef PPPOS
    case ARDUINO_EVENT_PPP_START:
        log_d("PPP Started");
        break;
    case ARDUINO_EVENT_PPP_CONNECTED:
        log_d("PPP Connected");
        if (!WiFi.isConnected())
        {
            if (config.vpn)
            {
                log_d("Setup Wireguard VPN by PPP!");
                vpnConnected = false;
                vpnTimeout = millis() + 3000;
            }

#ifdef MQTT
            if (config.en_mqtt)
            {
                if (!clientMQTT.connected())
                {
                    clientMQTT.disconnect();
                    clientMQTT.setServer(config.mqtt_host, config.mqtt_port);
                    clientMQTT.setCallback(mqtt_callback);
                }
                mqtt_reconnect();
            }
#endif
        }
        break;
    case ARDUINO_EVENT_PPP_GOT_IP:
        pppStatus.ip = info.got_ip.ip_info.ip.addr;
        pppStatus.gateway = info.got_ip.ip_info.gw.addr;
        pppStatus.netmask = info.got_ip.ip_info.netmask.addr;
        log_d("PPP Got IP");
        log_d("PPP IP: %s", IPAddress(pppStatus.ip).toString().c_str());
        log_d("PPP Gateway: %s", IPAddress(pppStatus.gateway).toString().c_str());
        log_d("PPP Subnet: %s", IPAddress(pppStatus.netmask).toString().c_str());
        WiFi.AP.enableNAPT(config.ppp_napt);
        break;
    case ARDUINO_EVENT_PPP_LOST_IP:
        log_d("PPP Lost IP");
        WiFi.AP.enableNAPT(false);
        pppTimeout = millis() + (60 * 1000);
        break;
    case ARDUINO_EVENT_PPP_DISCONNECTED:
        log_d("PPP Disconnected");
        WiFi.AP.enableNAPT(false);
        pppTimeout = millis() + (60 * 1000);
        break;
    case ARDUINO_EVENT_PPP_STOP:
        log_d("PPP Stopped");
        break;
#endif

    case ARDUINO_EVENT_WIFI_AP_START:
        log_d("AP Started");
        // log_d(WiFi.AP);
        break;
    case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
        log_d("AP STA Connected");
        break;
    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
        log_d("AP STA Disconnected");
        break;
    case ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED:
        log_d("AP STA IP Assigned: ");
        log_d("%s", IPAddress(info.wifi_ap_staipassigned.ip.addr).toString().c_str());
        break;
    case ARDUINO_EVENT_WIFI_AP_PROBEREQRECVED:
        log_d("AP Probe Request Received");
        break;
    case ARDUINO_EVENT_WIFI_AP_STOP:
        log_d("AP Stopped");
        break;
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
        wifiDisCount = 0;
        wifiDisconnecting = false;
        // String info = "WiFi Infor:";
        // info += "\nSSID: " + WiFi.SSID();
        // info += "\nRSSI: " + String(WiFi.RSSI()) + "dBm";
        // info += "\nIP: " + WiFi.localIP().toString();
        // info += "\nGW IP: " + WiFi.gatewayIP().toString();
        // info += "\nMAC: " + WiFi.macAddress();
        // lv_label_set_text(ui_txtSystemInfo, info.c_str());
        if (config.vpn)
        {
            log_d("Setup Wireguard VPN by WiFi!");
            vpnConnected = false;
            vpnTimeout = millis() + 3000;
        }
#ifdef MQTT
        if (config.en_mqtt)
        {
            if (!clientMQTT.connected())
            {
                clientMQTT.disconnect();
                clientMQTT.setServer(config.mqtt_host, config.mqtt_port);
                clientMQTT.setCallback(mqtt_callback);
            }
            mqtt_reconnect();
        }
#endif
        log_d("WiFi Connected");
        break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
        log_d("WiFi Disconnected");
        wifiDisCount++;
        if (wifiDisconnecting == false && wifiDisCount > 30)
        {
            wifiDisCount = 0;
            wifiDisconnecting = true;
            pingTimeout = millis() + 10000;
            wifiConnection();
#ifdef MQTT
            if (config.en_mqtt)
            {
                if (!clientMQTT.connected())
                {
                    clientMQTT.disconnect();
                    clientMQTT.setServer(config.mqtt_host, config.mqtt_port);
                    clientMQTT.setCallback(mqtt_callback);
                }
                mqtt_reconnect();
            }
#endif
#ifdef PPPOS
            if (config.vpn)
            {
                // if(PPP.connected()){
                vpnConnected = false;
                vpnTimeout = millis() + 1000;
                //}
            }
#endif
        }
        break;
    default:
        break;
    }
}

#ifdef PPPOS

void PPPOS_Start()
{
    if (config.ppp_enable)
    {
        pppTimeout = millis() + (600 * 1000);
        log_d("Starting the modem. It might take a while!");
        PPP.end();
        pinMode(config.ppp_rst_gpio, OUTPUT);
        digitalWrite(config.ppp_rst_gpio, config.ppp_rst_active);
        delay(config.ppp_rst_delay);
        digitalWrite(config.ppp_rst_gpio, !config.ppp_rst_active);
        // pinMode(39, INPUT_PULLUP); // Set GPIO39 as input with pull-up resistor
        //  digitalWrite(39, HIGH); // Set GPIO39 to high to enable pull-up resistor
        delay(1000); // Wait for the modem to reset

        PPP.setApn(config.ppp_apn); // Set the APN for the modem
        PPP.setResetPin(config.ppp_rst_gpio, config.ppp_rst_active, config.ppp_rst_delay);
        PPP.setPins(config.ppp_tx_gpio, config.ppp_rx_gpio);
        log_d("PPP Modem Init...");
        log_d("Using UART %d as PPP interface", config.ppp_serial);
        if (config.ppp_serial > 1)
            return;
        if (PPP.begin(PPP_MODEM_MODEL, config.ppp_serial, 115200))
        {
            log_d("PPP started successfully");
        }
        else
        {
            log_d("PPP failed to start");
            sprintf(pppStatus.manufacturer, "Not found modem");
            sprintf(pppStatus.model, "N/A");
            return;
        }

        // Configure the modem
        if (config.ppp_gnss)
        {
            Serial.println(PPP.cmd("AT+QGPSCFG=\"outport\",\"uartdebug\"", 10000)); // กำหนดให้ NMEA output ผ่านพอร์ต UART Debug
            Serial.println(PPP.cmd("AT+QGPSCFG=\"nmeasrc\",0", 10000));             // ปิดการดึง NMEA sentence ผ่าน AT+QGPSGNMEA
            Serial.println(PPP.cmd("AT+QGPSCFG=\"gpsnmeatype\",63", 10000));        // เปิดใช้งาน NMEA sentence ทั้งหมด (GGA, RMC, GSV, GSA, VTG, GLL)
            Serial.println(PPP.cmd("AT+QGPSCFG=\"gnssconfig\",1", 10000));          // เลือกใช้ระบบดาวเทียม GPS + BeiDou
            Serial.println(PPP.cmd("AT+QGPSCFG=\"autogps\",0", 10000));             // ปิดใช้งาน GNSS อัตโนมัติเมื่อโมดูลเริ่มทำงาน
            Serial.println(PPP.cmd("AT+QGPSCFG=\"apflash\",1", 10000));             // เปิดใช้งาน AP-Flash เพื่อการเริ่มต้นที่รวดเร็ว
            Serial.println(PPP.cmd("AT+QGPS=1", 10000));
        }

        PPP.cmd("AT+CTZU=1", 1000); // Enable automatic time zone update
        // PPP.setUser(ppp_user);
        // PPP.setPass(ppp_pass);
        // PPP.setApn(config.ppp_apn);
        // PPP.setPin(config.ppp_pin);
        // PPP.setResetPin(config.ppp_rst_gpio, config.ppp_rst_active, config.ppp_rst_delay);
        // PPP.setPins(config.ppp_tx_gpio, config.ppp_rx_gpio, config.ppp_rts_gpio, config.ppp_cts_gpio, PPP_MODEM_FC);

        PPP.setBaudrate(config.ppp_serial_baudrate); // Set the baud rate for the modem
        sprintf(pppStatus.manufacturer, "%s", PPP.cmd("AT+CGMI", 10000).c_str());
        sprintf(pppStatus.model, "%s", PPP.moduleName().c_str());
        sprintf(pppStatus.imei, "%s", PPP.IMEI().c_str());
        log_d("Manufacturer: %s", pppStatus.manufacturer);
        log_d("Model: %s", pppStatus.model);
        log_d("IMEI: %s", pppStatus.imei);

