clifjones/ESP32APRS_Audio/src/main.cpp
                                    if (ssid > 47 && ssid < 58)
                                    {
                                        size_t len = src_call.length();
                                        char call[15];
                                        memset(call, 0, sizeof(call));
                                        if (len > 15)
                                            len = 15;
                                        memcpy(call, src_call.c_str(), len);
                                        call[14] = 0;
                                        memset(raw, 0, rawSize + 1);
                                        memcpy(raw, line.c_str(), line.length());
                                        if (type & config.dispFilter)
                                        {
                                            int idx = pkgListUpdate(call, raw, type, 1, 0);
                                            // int cnt = 0;
                                            // if (idx > -1)
                                            // {
                                            // // Put queue affter filter for display popup
                                            // if (config.rx_display && config.dispINET)
                                            // {
                                            //     cnt = pushTNC2Raw(idx);
                                            //     log_d("INET_putQueueDisp:[pkgList_idx=%d/queue=%d,Type=%d] %s\n", idx, cnt, type, call);
                                            // }
                                            // }

#if defined OLED || defined ST7735_160x80
                                            if (idx > -1)
                                            {
                                                // Put queue affter filter for display popup
                                                if (config.rx_display && config.dispINET && (type & config.dispFilter))
                                                {
                                                    dispBuffer.push(line.c_str());
                                                    log_d("INET_putQueueDisp:[pkgList_idx=%d/queue=%d,Type=%d] %s\n", idx, dispBuffer.getCount(), type, call);
                                                }
                                            }
#endif
                                        }
                                        // INET2RF affter filter
                                        if (config.inet2rf)
                                        {
                                            if (type & config.inet2rfFilter)
                                            {
                                                String tnc2Raw = "";
                                                char *strtmp = (char *)calloc(350, sizeof(char));
                                                if (strtmp)
                                                {
                                                    if (config.aprs_ssid == 0)
                                                        sprintf(strtmp, "%s>APE32A", config.aprs_mycall);
                                                    else
                                                        sprintf(strtmp, "%s-%d>APE32A", config.aprs_mycall, config.aprs_ssid);
                                                    tnc2Raw = String(strtmp);
                                                    tnc2Raw += ",RFONLY"; // fix path to rf only not send loop to inet
                                                    tnc2Raw += ":}";      // 3rd-party frame
                                                    tnc2Raw += line;
                                                    pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0, RF_CHANNEL);
                                                    char sts[50];
                                                    sprintf(sts, "--SRC CALL--\n%s\n", src_call.c_str());
#if defined OLED || defined ST7735_160x80
                                                    if (config.oled_enable)
                                                        pushTxDisp(TXCH_3PTY, "TX INET->RF", sts);
#endif
                                                    status.inet2rf++;
                                                    igateTLM.INET2RF++;
                                                    log_d("INET2RF: %s\n", line);
                                                    free(strtmp);
                                                }
                                                tnc2Raw.clear();
                                            }
                                        }
                                    }
                                    free(raw);
                                }
                                info.clear();
                            }
                            src_call.clear();
                            msg_call.clear();
                        }
                        line.clear();
                    }
                }
            }

#ifdef MQTT
            if (config.en_mqtt)
            {
                if (!clientMQTT.connected())
                {
                    mqtt_reconnect();
                }
                else
                {
                    clientMQTT.loop();
                }
            }
#endif

            if (millis() > pingTimeout)
            {
                pingTimeout = millis() + 600000;
                if (config.wifi_mode & WIFI_STA_FIX)
                {
                    log_d("Ping WiFi to %s\n", WiFi.gatewayIP().toString().c_str());
                    IPAddress wifiIP;
                    wifiIP.fromString(String(WiFi.gatewayIP().toString()));
                    if (ping_start(wifiIP, 2, 0, 0, 10) == true)
                    {
                        log_d("Ping WiFi Success!!\n");
                    }
                    else
                    {
                        log_d("Ping WiFi Fail!\n");
                        wifiConnection();
                        // WiFi.disconnect(true, true, 500);
                        // WiFi.persistent(false);
                        // WiFi.mode(WIFI_OFF); // Switch WiFi off

                        // wifiTTL = 0;
                        // delay(3000);
                        // if (config.wifi_mode == WIFI_STA_FIX)
                        // { /**< WiFi station mode */
                        //     WiFi.mode(WIFI_MODE_STA);
                        //     //WiFi.setTxPower((wifi_power_t)config.wifi_power);
                        // }
                        // else if (config.wifi_mode == WIFI_AP_FIX)
                        // { /**< WiFi soft-AP mode */
                        //     WiFi.mode(WIFI_MODE_AP);
                        //     //WiFi.setTxPower((wifi_power_t)config.wifi_power);
                        // }
                        // else if (config.wifi_mode == WIFI_AP_STA_FIX)
                        // { /**< WiFi station + soft-AP mode */
                        //     WiFi.mode(WIFI_MODE_APSTA);
                        //     //WiFi.setTxPower((wifi_power_t)config.wifi_power);
                        // }
                        // else
                        // {
                        //     WiFi.mode(WIFI_MODE_NULL);
                        // }
                        // wifiMulti.APlistClean(); // Clean AP list
                        // for (int i = 0; i < 5; i++)
                        // {
                        //     if (config.wifi_sta[i].enable)
                        //     {
                        //         wifiMulti.addAP(config.wifi_sta[i].wifi_ssid, config.wifi_sta[i].wifi_pass);
                        //     }
                        // }
                        // WiFi.setHostname(config.host_name);
                        // if (wifiMulti.run() == WL_CONNECTED)
                        // {
                        //     wifiDisCount=0;
                        //     pingTimeout = millis() + 60000;
                        //     //NTP_Timeout = millis() + 2000;
                        // }
                        // wifiMulti.run(5000,true); // Timeout 5 sec
                        // WiFi.reconnect();
                    }
                }
// if (config.vpn)
// {
//     if (!wireguard_active())
//     {
//         log_d("Reconnection Wireguard VPN!");
//         wireguard_remove();
//         delay(1000);
//         if(WiFi.isConnected()){
//                 wireguard_setup(NULL);
//             }else{
//                 if(PPP.connected()){
//                     wireguard_setup((netif *)PPP.netif());
//                 }
//             }
//     }
//     IPAddress vpnIP;
//     vpnIP.fromString(String(config.wg_local_address));
//     log_d("Ping VPN to %s", vpnIP.toString().c_str());
//     if (ping_start(vpnIP, 2, 0, 0, 10) == true)
//     {
//         log_d("VPN Ping Success!");
//     }
//     else
//     {
//         log_d("VPN Ping Fail!");
//         wireguard_remove();
//         delay(1000);
//         wireguard_setup(NULL);

//     }
// }
#ifdef PPPOS
                if (config.ppp_enable)
                {
                    if (PPP.connected())
                    {
                        // IPAddress pppIP(pppStatus.ip);
                        log_d("Ping PPP to %s", PPP.localIP().toString().c_str());
                        if ((PPP.linkUp() == true) && (ping_start(PPP.localIP(), 2, 0, 0, 30) == true))
                        {
                            log_d("PPP Ping Success!!");
                        }
                        else
                        {
                            log_d("PPP Ping Fail!");
                            PPPOS_Start();
                            pppTimeout = millis() + (600 * 1000);
                        }
                    }
                }
#endif
            }
        }
    } // for loop
}

