clifjones/ESP32APRS_Audio/src/main.cpp
void systemDisp()
{

    // uint8 wifi = 0, k = 0, l;
    // char i;
    // char list[4];
    int x;
    String str;
    time_t upTime = now() - systemUptime;
    // String times;
    // pkgListType *ptr[100];
#ifdef OLED
#ifdef SSD1306_72x40
    display.clearDisplay();
    display.fillRect(0, 0, 72, 9, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(18, 1);
    display.print("SYSTEM");
    display.setTextColor(WHITE);
    display.setCursor(0, 12);
    display.print("UP:");
    str = String(day(upTime) - 1, DEC) + "D " + String(hour(upTime), DEC) + ":" + String(minute(upTime), DEC) + ":" + String(second(upTime), DEC);
    x = str.length() * 6;
    display.setCursor(71 - x, 12);
    display.print(str);

    display.setCursor(0, 22);
    display.print("FW:");
    str = "V" + String(VERSION) + String(VERSION_BUILD);
    x = str.length() * 6;
    display.setCursor(71 - x, 22);
    display.print(str);

    display.setCursor(0, 32);
    display.print("RAM:");
    // str = String((float)ESP.getFreeHeap() / 1024, 1) + "/" + String((float)ESP.getHeapSize() / 1024, 1) + "KB";
    str = String((float)ESP.getFreeHeap() / 1024, 1) + "KB";
    x = str.length() * 6;
    display.setCursor(71 - x, 32);
    display.print(str);
#else
    display.fillRect(0, 0, 128, 15, WHITE);
    display.drawRect(0, 16, 128, 48, WHITE);
    display.fillRect(1, 17, 126, 46, BLACK);

    display.setCursor(20, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("SYSTEM");
    display.setFont();
    display.setCursor(119, 7);
    display.print("4");
    display.setTextColor(WHITE);

    // display.setCursor(3, 18);
    // // display.print("HMEM:");
    // display.print("MAC");
    // // str = String(ESP.getFreeHeap(), DEC)+"Byte";
    // str = String(WiFi.macAddress());
    // x = str.length() * 6;
    // display.setCursor(126 - x, 18);
    // display.print(str);

    // display.setCursor(3, 26);
    // display.print("IP:");
    // str = String(WiFi.localIP().toString());
    // x = str.length() * 6;
    // display.setCursor(126 - x, 26);
    // display.print(str);

    display.setCursor(3, 18);
    display.print("UPTIME:");
    str = String(day(upTime) - 1, DEC) + "D " + String(hour(upTime), DEC) + ":" + String(minute(upTime), DEC) + ":" + String(second(upTime), DEC);
    x = str.length() * 6;
    display.setCursor(126 - x, 18);
    display.print(str);

    display.setCursor(3, 26);
    display.print("Firmware:");
    str = "V" + String(VERSION) + String(VERSION_BUILD);
    x = str.length() * 6;
    display.setCursor(126 - x, 26);
    display.print(str);

    display.setCursor(3, 35);
    display.print("RAM:");
    str = String((float)ESP.getFreeHeap() / 1024, 1) + "/" + String((float)ESP.getHeapSize() / 1024, 1) + "KB";
    x = str.length() * 6;
    display.setCursor(126 - x, 35);
    display.print(str);

    // display.setCursor(3, 44);
    // display.print("PSRAM:");
    // str = String((float)ESP.getFreePsram() / 1000, 1) + "/" + String((float)ESP.getPsramSize() / 1000, 1) +"KB";
    // x = str.length() * 6;
    // display.setCursor(126 - x, 44);
    // display.print(str);
    display.setCursor(3, 44);
    display.print("FILE:");
    str = String((float)LITTLEFS.usedBytes() / 1024, 1) + "/" + String((float)LITTLEFS.totalBytes() / 1024, 1) + "KB";
    x = str.length() * 6;
    display.setCursor(126 - x, 44);
    display.print(str);
#if defined(TTGO_T_Beam_S3_SUPREME_V3) || defined(TTGO_T_Beam_V1_2)
    display.setCursor(3, 53);
    display.print("BAT:");
    str = String((float)PMU.getBattVoltage() / 1000, 2) + "V" + "(" + String(PMU.getBatteryPercent()) + "%)";
    x = str.length() * 6;
    display.setCursor(126 - x, 53);
    display.print(str);
#endif
#endif
    display.display();
#elif defined(ST7735_160x80)
    display.fillRect(0, 0, 160, 15, WHITE);
    // display.drawRect(0, 16, 160, 64, WHITE);
    display.fillRect(0, 15, 160, 64, BLACK);

    display.setCursor(35, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("SYSTEM");
    display.setFont();
    display.setCursor(150, 7);
    display.print("4");
    display.setTextColor(WHITE);

    display.setCursor(3, 18);
    display.print("UPTIME:");
    str = String(day(upTime) - 1, DEC) + "D " + String(hour(upTime), DEC) + ":" + String(minute(upTime), DEC) + ":" + String(second(upTime), DEC);
    x = str.length() * 6;
    display.setCursor(158 - x, 18);
    display.print(str);

    display.setCursor(3, 28);
    display.print("Firmware:");
    str = "V" + String(VERSION) + String(VERSION_BUILD);
    x = str.length() * 6;
    display.setCursor(158 - x, 28);
    display.print(str);

    display.setCursor(3, 38);
    display.print("RAM:");
    str = String((float)ESP.getFreeHeap() / 1024, 1) + "/" + String((float)ESP.getHeapSize() / 1024, 1) + "KB";
    x = str.length() * 6;
    display.setCursor(158 - x, 38);
    display.print(str);

    display.setCursor(3, 48);
    display.print("PSRAM:");
    str = String((float)ESP.getFreePsram() / 1024, 1) + "/" + String((float)ESP.getPsramSize() / 1024, 1) + "KB";
    x = str.length() * 6;
    display.setCursor(158 - x, 48);
    display.print(str);

    display.setCursor(3, 58);
    display.print("FILE:");
    str = String((float)LITTLEFS.usedBytes() / 1024, 1) + "/" + String((float)LITTLEFS.totalBytes() / 1024, 1) + "KB";
    x = str.length() * 6;
    display.setCursor(158 - x, 58);
    display.print(str);
#if defined(TTGO_T_Beam_S3_SUPREME_V3) || defined(TTGO_T_Beam_V1_2)
    display.setCursor(3, 68);
    display.print("BAT:");
    str = String((float)PMU.getBattVoltage() / 1024, 2) + "V" + "(" + String(PMU.getBatteryPercent()) + "%)";
    x = str.length() * 6;
    display.setCursor(126 - x, 68);
    display.print(str);
#endif
    display.display();
#endif
}

void wifiDisp()
{

    // uint8 wifi = 0, k = 0, l;
    // char i;
    // char list[4];
    int x;
    String str;
    time_t upTime = now() - systemUptime;
    // String times;
    // pkgListType *ptr[100];
#ifdef OLED
#ifdef SSD1306_72x40
    display.clearDisplay();
    // display.drawRect(0, 0, 72, 40, WHITE);
    display.fillRect(0, 0, 72, 9, WHITE);
    // display.fillRect(1, 17, 126, 46, BLACK);
    display.setTextColor(BLACK);
    display.setCursor(25, 1);
    display.print("WiFi");
    display.setTextColor(WHITE);
    display.setCursor(6, 10);
    display.print("IP Address");
    str = String(WiFi.localIP().toString());
    // x = str.length() * 6;
    // display.setCursor(126 - x, 44);
    display.setCursor(0, 20);
    display.print(str);
    display.display();
#else
    display.fillRect(0, 0, 128, 15, WHITE);
    display.drawRect(0, 16, 128, 48, WHITE);
    display.fillRect(1, 17, 126, 46, BLACK);

    display.setCursor(20, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("WiFi Info");
    display.setFont();
    display.setCursor(119, 7);
    display.print("6");
    display.setTextColor(WHITE);

    display.setCursor(3, 18);
    display.print("MODE");
    str = "OFF";
    if (config.wifi_mode == WIFI_STA_FIX)
    {
        str = "STA";
    }
    else if (config.wifi_mode == WIFI_AP_FIX)
    {
        str = "AP";
    }
    else if (config.wifi_mode == WIFI_AP_STA_FIX)
    {
        str = "AP+STA";
    }
    x = str.length() * 6;
    display.setCursor(126 - x, 18);
    display.print(str);

    display.setCursor(3, 26);
    display.print("SSID");
    str = WiFi.SSID().substring(0, 15);
    x = str.length() * 6;
    display.setCursor(126 - x, 26);
    display.print(str);

    display.setCursor(3, 35);
    display.print("RSSI:");
    str = String(WiFi.RSSI()) + "dBm";
    x = str.length() * 6;
    display.setCursor(126 - x, 35);
    display.print(str);

    display.setCursor(3, 44);
    display.print("IP:");
    str = String(WiFi.localIP().toString());
    x = str.length() * 6;
    display.setCursor(126 - x, 44);
    display.print(str);

    display.setCursor(3, 53);
    display.print("MAC");
    str = String(WiFi.macAddress());
    x = str.length() * 6;
    display.setCursor(126 - x, 53);
    display.print(str);
    display.display();
#endif
#elif defined(ST7735_160x80)
    display.fillRect(0, 0, 160, 15, WHITE);
    // display.drawRect(0, 16, 160, 64, WHITE);
    display.fillRect(0, 15, 160, 64, BLACK);

    display.setCursor(35, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    if (manualWiFi)
        display.print("WiFi [ON]");
    else
        display.print("WiFi [OFF]");
    display.setFont();
    display.setCursor(150, 7);
    display.print("6");
    display.setTextColor(WHITE);

    display.setCursor(3, 18);
    display.print("MODE");
    str = "OFF";
    if (config.wifi_mode == WIFI_STA_FIX)
    {
        str = "STA";
    }
    else if (config.wifi_mode == WIFI_AP_FIX)
    {
        str = "AP";
    }
    else if (config.wifi_mode == WIFI_AP_STA_FIX)
    {
        str = "AP+STA";
    }
    x = str.length() * 6;
    display.setCursor(158 - x, 18);
    display.print(str);

    display.setCursor(3, 28);
    display.print("SSID");
    str = WiFi.SSID().substring(0, 15);
    x = str.length() * 6;
    display.setCursor(158 - x, 28);
    display.print(str);

