clifjones/ESP32APRS_Audio/src/main.cpp
    display.setCursor(3, 38);
    display.print("RSSI:");
    str = String(WiFi.RSSI()) + "dBm";
    x = str.length() * 6;
    display.setCursor(158 - x, 38);
    display.print(str);

    display.setCursor(3, 48);
    display.print("IP:");
    str = String(WiFi.localIP().toString());
    x = str.length() * 6;
    display.setCursor(158 - x, 48);
    display.print(str);

    display.setCursor(3, 58);
    display.print("AP_IP:");
    str = String(WiFi.softAPIP().toString());
    x = str.length() * 6;
    display.setCursor(158 - x, 58);
    display.print(str);

    display.setCursor(3, 68);
    display.print("MAC");
    str = String(WiFi.macAddress());
    x = str.length() * 6;
    display.setCursor(158 - x, 68);
    display.print(str);
    display.display();
#endif
}

void radioDisp()
{

    // uint8 wifi = 0, k = 0, l;
    // char i;
    // char list[4];
    int x;
    String str;
    time_t upTime = now() - systemUptime;
    // String times;
    // pkgListType *ptr[100];
#ifdef OLED
#ifdef SSD1306_72x40
    display.clearDisplay();
    display.fillRect(0, 0, 72, 9, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(21, 1);
    display.print("RADIO");
    display.setTextColor(WHITE);
    // str = String(config.rf_freq, 3) + " MHz";
    // x = str.length() * 6;
    // display.setCursor(126 - x, 18);
    display.setCursor(0, 12);
    display.printf("%.3f Mhz", config.rf_freq);
    display.setCursor(0, 22);
    display.printf("BW: %.1fKhz", config.rf_bw);
    if (config.rf_power >= 0)
        str = "Pwr:+" + String(config.rf_power) + " dBm";
    else
        str = "Pwr:-" + String(config.rf_power) + " dBm";
    x = str.length() * 6;
    display.setCursor(0, 32);
    display.print(str);
#else
    display.fillRect(0, 0, 128, 15, WHITE);
    display.drawRect(0, 16, 128, 48, WHITE);
    display.fillRect(1, 17, 126, 46, BLACK);

    display.setCursor(10, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("RADIO Info");
    display.setFont();
    display.setCursor(119, 7);
    display.print("5");
    display.setTextColor(WHITE);

    display.setCursor(3, 18);
    display.print("FreqRX:");
    str = String(config.freq_rx, 3) + " MHz";
    x = str.length() * 6;
    display.setCursor(126 - x, 18);
    display.print(str);

    display.setCursor(3, 26);
    display.print("FreqTX:");
    str = String(config.freq_tx, 3) + " MHz";
    x = str.length() * 6;
    display.setCursor(126 - x, 26);
    display.print(str);

    display.setCursor(3, 35);
    display.print("Modem:");
    str = String(MODEM_TYPE[config.modem_type]);
    x = str.length() * 6;
    display.setCursor(126 - x, 35);
    display.print(str);

    display.setCursor(3, 44);
    display.print("FX.25");
    str = String(FX25_MODE[config.fx25_mode]);
    x = str.length() * 6;
    display.setCursor(126 - x, 44);
    display.print(str);

    display.setCursor(3, 53);
    display.print("Bandwidth:");
    if (!config.band)
        str = "12.5Khz";
    else
        str = "25.0Khz";
    x = str.length() * 6;
    display.setCursor(126 - x, 53);
    display.print(str);

    // display.setCursor(3, 53);
    // display.print("TX Power");
    // // str = "V" + String(VERSION);
    // if (config.rf_power >= 0)
    //     str = "+" + String(config.rf_power) + " dBm";
    // else
    //     str = "-" + String(config.rf_power) + " dBm";
    // x = str.length() * 6;
    // display.setCursor(126 - x, 53);
    // display.print(str);
#endif
    display.display();
#elif defined(ST7735_160x80)
    display.fillRect(0, 0, 160, 15, WHITE);
    // display.drawRect(0, 16, 160, 64, WHITE);
    display.fillRect(0, 15, 160, 64, BLACK);

    display.setCursor(35, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    if (config.rf_en)
        display.print("RADIO [ON]");
    else
        display.print("RADIO [OFF]");
    display.setFont();
    display.setCursor(150, 7);
    display.print("5");
    display.setTextColor(WHITE);

    display.setCursor(3, 18);
    display.print("Frequency");
    str = String(config.rf_freq, 3) + " MHz";
    x = str.length() * 6;
    display.setCursor(158 - x, 18);
    display.print(str);

    display.setCursor(3, 28);
    display.print("Bandwidth");
    str = String(config.rf_bw, 2) + " Khz";
    x = str.length() * 6;
    display.setCursor(158 - x, 28);
    display.print(str);

    display.setCursor(3, 38);
    display.print("Spread Factor");
    str = String(config.rf_sf);
    x = str.length() * 6;
    display.setCursor(158 - x, 38);
    display.print(str);

    display.setCursor(3, 48);
    display.print("Coding Rate");
    str = String(config.rf_cr);
    x = str.length() * 6;
    display.setCursor(158 - x, 48);
    display.print(str);

    display.setCursor(3, 58);
    display.print("TX Power");
    if (config.rf_power >= 0)
        str = "+" + String(config.rf_power) + " dBm";
    else
        str = "-" + String(config.rf_power) + " dBm";
    x = str.length() * 6;
    display.setCursor(158 - x, 58);
    display.print(str);
    display.display();
#endif
}

void sensorDisp()
{

    // uint8 wifi = 0, k = 0, l;
    uint k = 0;
    int i;
    // char list[4];
    int x, y;
    String str;
    // String times;
    // pkgListType *ptr[100];
#ifdef OLED
#ifdef SSD1306_72x40
    display.clearDisplay();
    display.fillRect(0, 0, 72, 9, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(18, 1);
    display.print("SENSOR");
    display.setTextColor(WHITE);
    for (i = 0; i < 10; i++)
    {
        if (config.sensor[i].enable)
        {
            y = 12 + (k * 9);
            if (++k > 5)
                break;
            display.setTextColor(WHITE);
            display.setCursor(0, y);
            display.printf("%i:", i + 1);
            // display.print(String(config.sensor[i].parm).substring(0, 12));
            str = String(sen[i].sample, 2) + String(config.sensor[i].unit);
            x = str.length() * 6;
            display.setCursor(71 - x, y);
            display.print(str);
        }
    }
#else
    display.fillRect(0, 0, 128, 15, WHITE);
    display.drawRect(0, 16, 128, 48, WHITE);
    display.fillRect(1, 17, 126, 46, BLACK);

    display.setCursor(20, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("SENSOR");
    display.setFont();
    display.setCursor(119, 7);
    display.print("7");
    display.setTextColor(WHITE);

    for (i = 0; i < 10; i++)
    {
        if (config.sensor[i].enable)
        {
            y = 18 + (k * 9);
            if (++k > 5)
                break;
            display.setTextColor(WHITE);
            display.setCursor(2, y);
            display.print(String(config.sensor[i].parm).substring(0, 12));
            str = String(sen[i].sample, 2) + String(config.sensor[i].unit);
            x = str.length() * 6;
            display.setCursor(126 - x, y);
            display.print(str);
        }
    }
#endif
    display.display();
#elif defined(ST7735_160x80)
    display.fillRect(0, 0, 160, 15, WHITE);
    // display.drawRect(0, 16, 160, 64, WHITE);
    display.fillRect(0, 15, 160, 64, BLACK);

    display.setCursor(35, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("SENSOR");
    display.setFont();
    display.setCursor(150, 7);
    display.print("7");
    display.setTextColor(WHITE);

    for (i = 0; i < 10; i++)
    {
        if (config.sensor[i].enable)
        {
            y = 18 + (k * 9);
            if (++k > 6)
                break;
            display.setTextColor(WHITE);
            display.setCursor(2, y);
            display.print(String(config.sensor[i].parm).substring(0, 15));
            str = String(sen[i].sample, 2) + String(config.sensor[i].unit);
            x = str.length() * 6;
            display.setCursor(158 - x, y);
            display.print(str);
        }
    }
    display.display();
#endif
}

void gpsDisp()
{
    int x;
    String str;

